darah (rest api)/app/Controllers/ProdukController.php

INSERT INTO `produk` (`kode_produk`, `nama_produk`, `harga`) VALUES ('A001', 'Smart TV 50 Inch', '570000')
SELECT *
FROM `produk`
WHERE `produk`.`id` = 1
---
    public function create()
    {
        $data = [
            'kode_produk' => $this->request->getVar('kode_produk'),
            'nama_produk' => $this->request->getVar('nama_produk'),
            'harga' => $this->request->getVar('harga')
        ];

        $model = new MProduk();
        $model->insert($data);
        $produk = $model->find($model->getInsertID());

SELECT *
FROM `produk`
---
    public function list()
    {
        $model = new MProduk();
        $produk = $model->findAll();

SELECT *
FROM `produk`
WHERE `produk`.`id` = '{id}'
---
    public function detail($id)
    {
        $model = new MProduk();
        $produk = $model->find($id);

SELECT *
FROM `produk`
WHERE `produk`.`id` = '{id}'
---
    public function ubah($id)
    {
        $data = [
            'kode_produk' => $this->request->getVar('kode_produk'),
            'nama_produk' => $this->request->getVar('nama_produk'),
            'harga' => $this->request->getVar('harga')
        ];

        $model = new MProduk();
        $model->update($id, $data);
        $produk = $model->find($id);

DELETE FROM `produk`
WHERE `id` IN ('{id}')
---
    public function hapus($id)
    {
        $model = new MProduk();
        $produk = $model->delete($id);